// Напишите программу, которая на фход принимает число и выдает его квадрат.

Console.WriteLine("Write a number: ");

int a = int.Parse(Console.ReadLine());
Console.WriteLine(a * a);
