// // Напишите программу, которая принимает на вход число
// и выдает колличество чисел в числе.
// 456 -> 3
// 78 -> 2
// 89125 -> 5

void SumNum(int a)
{
    string num = a.ToString();
    Console.WriteLine(num.Length);
}
SumNum(4321);
